Community-PIO-CH32V/ArduinoCore-CH32H4/cores/ch32h4/ch32h4_sdmmc.c
/* SD card on the CH32H417's SDMMC controller.
 *
 * Ported from the MicroPython port for this silicon. Every comment about what
 * the hardware actually does was paid for on a bench; none of it is inferred
 * from the reference manual, and several parts contradict what the symmetry of
 * the register set suggests. Change nothing here without a card to test on.
 *
 * The chip has two card controllers. SDIO is the familiar STM32F4-shaped one
 * (POWER/CLKCR/DTIMER/FIFO); SDMMC is WCH's own, does up to 200 MHz, and is
 * the one used here -- it is the better block, and it is the one whose pins
 * this board brings out. Its signals are not on the numbered AF mux: the pads
 * come from an AFIO remap field, which is why the pins below are configured as
 * plain alternate-function push-pull with no GPIO_PinAFConfig call. The three
 * mappings are:
 *
 *              CK     CMD    D0     D1     D2     D3    D4    D5    D6   D7
 *   default    PC12   PD2    PC8    PC9    PC10   PC11  PA14  PA15  PC6  PC7
 *   partial    PD11   PD12   PB13   PC9    PB10   PB11  PA14  PA15  PC6  PC7
 *   full       PC12   PC10   PD0    PD1    PD2    PD3   PD4   PD5   PD6  PD7
 *
 * Only the default mapping is wired up here. The other two are a one-line
 * change (GPIO_PinRemapConfig) plus a pin table, and nothing else in this file
 * depends on which is selected.
 *
 * Every SDMMC pin is on VIO18 rather than VDDIO, so the rail has to be up
 * before a card will answer. At the 1.2 V the chip powers up with, a card sees
 * no valid high level at all and CMD0 never even gets a response;
 * ch32h4_v3f_main() raises it to 3.3 V during boot, and begin() checks rather
 * than letting that failure look like bad wiring.
 *
 * Data moves by the controller's own DMA, always through sd_dma_buf. The
 * caller's buffer is essentially never usable directly: it has to be 16-byte
 * aligned and outside DTCM, and DTCM is where .data, .bss and the fast half of
 * the heap live -- the same limit the USB and Ethernet DMA have. A direct path
 * would be code that never runs.
 */
#include <stdbool.h>
#include <string.h>

#include "Arduino.h"
#include "ch32h417.h"
#include "ch32h4_sdmmc.h"
#include "system_ch32h417.h"

/* Prints every command, its flags and its response. Off in a normal build;
 * the one thing that makes a card that will not identify tractable. */
#ifndef SD_TRACE
#define SD_TRACE 0
#endif

#define SD_BLOCK_SIZE CH32H4_SD_BLOCK_SIZE

/* CMD6 answers with a fixed 64-byte function status block. */
#define SD_SWITCH_STATUS_SIZE 64

/* Pins of the default mapping, in the order the controller uses them. */
#define SD_PORT_CK   GPIOC
#define SD_PIN_CK    GPIO_Pin_12
#define SD_PORT_CMD  GPIOD
#define SD_PIN_CMD   GPIO_Pin_2
#define SD_PORT_D0   GPIOC
#define SD_PIN_D0    GPIO_Pin_8
#define SD_PORT_D1   GPIOC
#define SD_PIN_D1    GPIO_Pin_9
#define SD_PORT_D2   GPIOC
#define SD_PIN_D2    GPIO_Pin_10
#define SD_PORT_D3   GPIOC
#define SD_PIN_D3    GPIO_Pin_11

/* SD commands. ACMDs are sent as CMD55 followed by the command itself. */
enum {
    SD_CMD_GO_IDLE_STATE = 0,
    SD_CMD_ALL_SEND_CID = 2,
    SD_CMD_SEND_RELATIVE_ADDR = 3,
    SD_CMD_SWITCH_FUNC = 6,
    SD_CMD_SELECT_CARD = 7,
    SD_CMD_SEND_IF_COND = 8,
    SD_CMD_SEND_CSD = 9,
    SD_CMD_STOP_TRANSMISSION = 12,
    SD_CMD_SEND_STATUS = 13,
    SD_CMD_SET_BLOCKLEN = 16,
    SD_CMD_READ_SINGLE_BLOCK = 17,
    SD_CMD_READ_MULTIPLE_BLOCK = 18,
    SD_CMD_WRITE_BLOCK = 24,
    SD_CMD_WRITE_MULTIPLE_BLOCK = 25,
    SD_CMD_APP_CMD = 55,
    SD_ACMD_SET_BUS_WIDTH = 6,
    SD_ACMD_SEND_OP_COND = 41,
};

/* Response shapes, as the CMD_SET register wants them: the length in
 * RPTY[9:8], plus whether the hardware should check the CRC and the echoed
 * command index. R3 carries neither -- the OCR response has no CRC and
 * reserved bits where the index goes -- and R2's index field is reserved too,
 * so checking either one rejects a perfectly good response. */
#define SD_RESP_NONE (0x0000)
#define SD_RESP_R1   (0x0200 | 0x0400 | 0x0800)
#define SD_RESP_R1B  (0x0300 | 0x0400 | 0x0800)
#define SD_RESP_R2   (0x0100 | 0x0400)
#define SD_RESP_R3   (0x0200)
#define SD_RESP_R6   SD_RESP_R1
#define SD_RESP_R7   SD_RESP_R1

/* Bits of the R1 card status that mean the command did not do what was asked.
 * Bit 8 (READY_FOR_DATA) and bits 12:9 (CURRENT_STATE) are not errors. */
#define SD_R1_ERROR_MASK (0xFDF98008u)

ch32h4_sd_t ch32h4_sd;

/* Bounce buffer for transfers the DMA cannot do in place, which in practice is
 * all of them: the heap fills its DTCM area long before it touches the shared
 * one, so every buffer a sketch is likely to pass in lives where this
 * controller cannot reach. Eight blocks rather than one, so a bounced
 * multi-block transfer stays a multi-block transfer. */
#define SD_BOUNCE_BLOCKS 8
static uint8_t sd_dma_buf[2][SD_BOUNCE_BLOCKS * SD_BLOCK_SIZE]
    __attribute__((aligned(16), section(".sdram")));
static uint8_t sd_dma_half;

/* The command trace. Always compiled -- it is 24 entries of three words, and
 * a card that will not identify is close to intractable without it. Recorded
 * rather than printed at the point of the command: printing between commands
 * changes the spacing on the bus, which is the very thing worth measuring. */
ch32h4_sd_log_entry_t ch32h4_sd_log[CH32H4_SD_LOG_MAX];
uint8_t ch32h4_sd_log_n;

/* --- controller --- */

/* SDCLK as last programmed, so the inter-command gap can be sized in bus
 * clocks rather than guessed in microseconds. */
static uint32_t sd_clk_hz = 400000;

/* NCC: the SD specification requires at least eight clock cycles between the
 * end of one command's response and the start of the next command, and this
 * controller does not insert them. Without this the card is still releasing
 * the CMD line when the next command starts, and the response that comes back
 * is mangled: CMD55 issued straight after CMD8 reports a response-index error
 * with no CMDDONE at all and the previous command's response still sitting in
 * the register. It reproduces every time at 400 kHz, and disappeared the
 * moment a debug print was added between commands -- which is what pointed at
 * the spacing rather than at the command.
 *
 * Eight cycles is 20 us at the 400 kHz identification clock and 0.4 us at
 * 20 MHz, so this costs nothing once the bus speeds up. */
static void sd_cmd_gap(void) {
    uint32_t us = (8000000u + sd_clk_hz - 1) / sd_clk_hz;
    delayMicroseconds(us < 1 ? 1 : us);
}

/* SDCK = SYSPLL / div in high-speed mode, and SYSPLL / div / 64 in low-speed
 * mode, with div in 2..31. The two ranges do not meet -- at a 400 MHz SYSPLL
 * low mode tops out at 3.1 MHz and high mode bottoms out at 12.9 MHz -- so
 * pick whichever can reach the request, preferring the one that does not
 * overshoot it. Returns the frequency actually programmed. */
static uint32_t sd_set_clock(uint32_t hz) {
    uint32_t src = SystemClock;
    uint32_t div, actual, mode;

