Community-PIO-CH32V/ArduinoCore-CH32H4/cores/ch32h4/ch32h4_sdmmc.c
    if (hz >= src / 31) {
        div = (src + hz - 1) / hz;
        if (div < 2) {
            div = 2;
        }
        if (div > 31) {
            div = 31;
        }
        mode = SDMMC_CLKMode;
        actual = src / div;
    } else {
        uint32_t low = src / 64;
        div = (low + hz - 1) / hz;
        if (div < 2) {
            div = 2;
        }
        if (div > 31) {
            div = 31;
        }
        mode = 0;
        actual = low / div;
    }

    SDMMC->CLK_DIV = (uint16_t)(mode | div | SDMMC_CLKOE);
    sd_clk_hz = actual;
    return actual;
}

static void sd_pin_af(GPIO_TypeDef *port, uint16_t mask) {
    GPIO_InitTypeDef init = {0};
    init.GPIO_Pin = mask;
    init.GPIO_Mode = GPIO_Mode_AF_PP;
    init.GPIO_Speed = GPIO_Speed_Very_High;
    GPIO_Init(port, &init);
}

/* Released to a PULL-UP, not to floating.
 *
 * CMD and every DAT line on an SD bus idle high, held there by pull-ups. A
 * breakout board usually has them; bare wiring to a header often does not, and
 * this core cannot tell which it has. Floating the pins in end() leaves those
 * lines undriven and undefined, and a card that sees noise on CMD while it is
 * unclocked does not reliably come back.
 *
 * The internal pull-ups are weak -- tens of kilohms against the 10k to 50k the
 * spec wants -- so this is not a substitute for real ones at speed. It is
 * enough to keep the bus in a defined state while nothing is driving it. */
static void sd_pin_release(GPIO_TypeDef *port, uint16_t mask) {
    GPIO_InitTypeDef init = {0};
    init.GPIO_Pin = mask;
    init.GPIO_Mode = GPIO_Mode_IPU;
    init.GPIO_Speed = GPIO_Speed_Low;
    GPIO_Init(port, &init);
}

static void sd_controller_reset(uint8_t width) {
    RCC_HBPeriphClockCmd(RCC_HBPeriph_SDMMC, ENABLE);
    /* Read back after every RCC write in this function.
     *
     * RCC_HBPeriphClockCmd and RCC_HBPeriphResetCmd are both read-modify-
     * writes with no read-back of their own, so nothing pushes the store out
     * and the access that follows can be dropped. The reset DE-ASSERT below is
     * the one that actually matters: lose it and the block stays held in
     * reset, so the CONTROL write is ignored, the controller never runs a
     * command, and CMD0 completes no flag at all.
     *
     * What that looks like is worth writing down, because it does not look
     * like a clocking problem. begin() reports a timeout, and the command
     * trace is EMPTY -- zero entries, not a failed CMD0 -- which is what says
     * the command never reached the bus rather than the card refusing it.
     * begin() then fails on every subsequent call and only a board reset
     * clears it, because only a board reset releases the block.
     *
     * MicroPython never hits this because it initialises the controller once.
     * An Arduino sketch calling SD.begin() twice does. */
    (void)RCC->HBPCENR;

    /* SWP_TBYP disables SWPMI's internal transceiver, which releases its
     * signals to the GPIO mux. That matters here because SWPMI shares pads
     * with this controller: SWPMI_IO is PC6, and SWP_TX/RX/SUP are PC7, PC8
     * and PC9 -- which are SDMMC D6, D7, D0 and D1.
     *
     * Measured: 1-bit mode passes its whole suite without this, so the
     * transceiver at its reset setting does not actually hold DAT0 on PC8. It
     * is kept anyway because the vendor's SD_GPIO_Init() does it, because
     * 4-bit mode also needs PC9 and there is no 4-bit wiring here to test it
     * on, and because it costs one register write. The clock stays on
     * afterwards rather than being gated again, since nothing says the bit
     * survives its block being gated. */
    RCC_HB1PeriphClockCmd(RCC_HB1Periph_SWPMI, ENABLE);
    (void)RCC->HB1PCENR;
    SWPMI->OR |= (1u << 0);

    RCC_HBPeriphResetCmd(RCC_HBPeriph_SDMMC, ENABLE);
    (void)RCC->HBRSTR;
    RCC_HBPeriphResetCmd(RCC_HBPeriph_SDMMC, DISABLE);
    (void)RCC->HBRSTR;

    /* CONTROL comes out of reset as 0x0015: ALL_CLR and RST_LGC asserted, one
     * data line. Clearing those two is what takes the controller out of reset,
     * so this write is not merely configuration.
     *
     * NEGSMP samples CMD and data on the falling clock edge, which is what the
     * vendor driver uses at every speed. */
    SDMMC->CONTROL = (uint16_t)((width == 4 ? SDMMC_LW_MASK_0 : 0)
                                | SDMMC_DMAEN | SDMMC_NEGSMP);
    SDMMC->TIMEOUT = 0x0F;
    SDMMC->INT_EN = 0;
    SDMMC->INT_FG = 0xFFFF;
    SDMMC->TRAN_MODE = 0;
    SDMMC->BLOCK_CFG = 0;
}

/* Wait for the card to release DAT0, which it holds low while it is busy
 * programming. Every transfer starts with this. */
static int sd_wait_dat0(void) {
    uint32_t deadline = millis() + 1000;
    while ((SDMMC->STATUS & SDMMC_DAT0STA) == 0) {
        if ((int32_t)(millis() - deadline) > 0) {
            return CH32H4_SD_ETIMEDOUT;
        }
    }
    return 0;
}

/* Send one command and wait for its response.
 *
 * Returns 0, or ETIMEDOUT if the card said nothing, or EIO if the response
 * came back malformed. */
static int sd_cmd(uint8_t idx, uint32_t arg, uint32_t resp) {
    sd_cmd_gap();
    SDMMC->INT_FG = SDMMC_IF_CMDDONE | SDMMC_IF_RE_TMOUT
                    | SDMMC_IF_RECRC_WR | SDMMC_IF_REIDX_ER | SDMMC_IF_DATTMO;

    SDMMC->ARGUMENT = arg;
    SDMMC->CMD_SET = (uint16_t)((idx & SDMMC_CMDIDX_MASK) | resp);

    /* Long enough for an R1b whose card holds DAT0 low through an erase; the
     * hardware's own timeout fires well before this and reports a flag. */
    uint32_t deadline = millis() + 1000;
    uint16_t fg;
    for (;;) {
        fg = SDMMC->INT_FG;
        if (fg & (SDMMC_IF_CMDDONE | SDMMC_IF_RE_TMOUT
                  | SDMMC_IF_RECRC_WR | SDMMC_IF_REIDX_ER | SDMMC_IF_DATTMO)) {
            break;
        }
        if ((int32_t)(millis() - deadline) > 0) {
            return CH32H4_SD_ETIMEDOUT;
        }
    }

    if (ch32h4_sd_log_n < CH32H4_SD_LOG_MAX) {
        ch32h4_sd_log[ch32h4_sd_log_n].cmd = idx;
        ch32h4_sd_log[ch32h4_sd_log_n].flags = fg;
        ch32h4_sd_log[ch32h4_sd_log_n].resp = SDMMC->RESPONSE3;
        ch32h4_sd_log_n++;
    }

    if (resp == SD_RESP_NONE) {
        /* Nothing to wait for beyond the command leaving the pin; CMDDONE is
         * still set for it, and a timeout flag here means nothing. */
        return 0;
    }
    if (fg & (SDMMC_IF_RE_TMOUT | SDMMC_IF_DATTMO)) {
        return CH32H4_SD_ETIMEDOUT;
    }
    if (fg & (SDMMC_IF_RECRC_WR | SDMMC_IF_REIDX_ER)) {
        return CH32H4_SD_EIO;
    }
    return 0;
}

