Community-PIO-CH32V/ArduinoCore-CH32H4/cores/ch32h4/ch32h4_sdmmc.c
/* A 48-bit response lands in RESPONSE3, not RESPONSE0: the registers are
 * numbered from the low end of the 128-bit field and a short response occupies
 * the top of it. Getting this backwards yields plausible-looking zeros from
 * every command, so it is worth stating twice. */
static uint32_t sd_resp_short(void) {
    return SDMMC->RESPONSE3;
}

static void sd_resp_long(uint32_t out[4]) {
    out[0] = SDMMC->RESPONSE3;  /* bits 127:96 */
    out[1] = SDMMC->RESPONSE2;
    out[2] = SDMMC->RESPONSE1;
    out[3] = SDMMC->RESPONSE0;  /* bits 31:0 */
}

/* R1 responses carry the card's status; a command the card refused still
 * answers, so the flags have to be looked at separately from the transport. */
static int sd_cmd_r1(uint8_t idx, uint32_t arg, uint32_t resp) {
    int ret = sd_cmd(idx, arg, resp);
    if (ret != 0) {
        return ret;
    }
    if (sd_resp_short() & SD_R1_ERROR_MASK) {
        return CH32H4_SD_EIO;
    }
    return 0;
}

static int sd_app_cmd(ch32h4_sd_t *self, uint8_t idx, uint32_t arg, uint32_t resp) {
    int ret = sd_cmd_r1(SD_CMD_APP_CMD, (uint32_t)self->rca << 16, SD_RESP_R1);
    if (ret != 0) {
        return ret;
    }
    return sd_cmd(idx, arg, resp);
}

/* --- card bring-up --- */

/* Defined with the rest of the data path below, because it is a data
 * transfer: CMD6 answers on the data lines, not in a response register. */
static bool sd_try_high_speed(void);

static uint32_t sd_capacity_blocks(const uint32_t csd[4]) {
    uint32_t structure = csd[0] >> 30;
    if (structure >= 1) {
        /* CSD version 2.0 and 3.0: C_SIZE is bits 69:48 and counts 512 KB
         * units, less one. */
        uint32_t c_size = ((csd[1] & 0x3F) << 16) | (csd[2] >> 16);
        return (c_size + 1) * 1024;
    }
    /* CSD version 1.0: capacity is (C_SIZE + 1) << (C_SIZE_MULT + 2) blocks of
     * READ_BL_LEN bytes, which this normalises to 512-byte blocks. C_SIZE is
     * bits 73:62, C_SIZE_MULT bits 49:47, READ_BL_LEN bits 83:80. */
    uint32_t read_bl_len = (csd[1] >> 16) & 0x0F;
    uint32_t c_size = ((csd[1] & 0x3FF) << 2) | (csd[2] >> 30);
    uint32_t c_size_mult = (csd[2] >> 15) & 0x07;
    uint32_t blocks = (c_size + 1) << (c_size_mult + 2);
    if (read_bl_len > 9) {
        blocks <<= (read_bl_len - 9);
    }
    return blocks;
}

static int sd_card_identify(ch32h4_sd_t *self) {
    int ret;

    ch32h4_sd_log_n = 0;

    self->rca = 0;
    self->card_type = CH32H4_SD_CARD_NONE;

    /* 400 kHz for identification, as the spec requires, and at least 74 clocks
     * on the bus before the first command. */
    sd_set_clock(400000);
    delay(2);

    ret = sd_cmd(SD_CMD_GO_IDLE_STATE, 0, SD_RESP_NONE);
    if (ret != 0) {
        return ret;
    }
    delay(2);

    /* CMD8 tells a v2 card we can supply 2.7-3.6 V and asks it to echo the
     * check pattern back. Older cards answer nothing at all, which is not an
     * error -- it is how they identify themselves. */
    bool v2 = false;
    if (sd_cmd(SD_CMD_SEND_IF_COND, 0x1AA, SD_RESP_R7) == 0) {
        if ((sd_resp_short() & 0xFFF) != 0x1AA) {
            return CH32H4_SD_EIO;
        }
        v2 = true;
    } else {
        /* A card that ignored CMD8 has left the controller unhappy; start over
         * so ACMD41 sees a clean state. */
        ret = sd_cmd(SD_CMD_GO_IDLE_STATE, 0, SD_RESP_NONE);
        if (ret != 0) {
            return ret;
        }
        delay(2);
    }

    /* ACMD41 until the card finishes its power-up. HCS (bit 30) is only
     * meaningful to a v2 card and asks for block addressing. */
    uint32_t ocr = 0;
    uint32_t deadline = millis() + 1000;
    for (;;) {
        ret = sd_app_cmd(self, SD_ACMD_SEND_OP_COND,
                         (v2 ? 0x40000000u : 0u) | 0x00FF8000u, SD_RESP_R3);
        if (ret != 0) {
            return ret;
        }
        ocr = sd_resp_short();
        if (ocr & 0x80000000u) {
            break;
        }
        if ((int32_t)(millis() - deadline) > 0) {
            return CH32H4_SD_ETIMEDOUT;
        }
        delay(1);
    }
    self->card_type = (ocr & 0x40000000u) ? CH32H4_SD_CARD_SDHC
                                          : CH32H4_SD_CARD_SDSC;

    ret = sd_cmd(SD_CMD_ALL_SEND_CID, 0, SD_RESP_R2);
    if (ret != 0) {
        return ret;
    }
    sd_resp_long(self->cid);

    ret = sd_cmd(SD_CMD_SEND_RELATIVE_ADDR, 0, SD_RESP_R6);
    if (ret != 0) {
        return ret;
    }
    self->rca = (uint16_t)(sd_resp_short() >> 16);
    if (self->rca == 0) {
        return CH32H4_SD_EIO;
    }

    ret = sd_cmd(SD_CMD_SEND_CSD, (uint32_t)self->rca << 16, SD_RESP_R2);
    if (ret != 0) {
        return ret;
    }
    sd_resp_long(self->csd);
    self->block_count = sd_capacity_blocks(self->csd);

    ret = sd_cmd_r1(SD_CMD_SELECT_CARD, (uint32_t)self->rca << 16, SD_RESP_R1B);
    if (ret != 0) {
        return ret;
    }

    if (self->width == 4) {
        ret = sd_app_cmd(self, SD_ACMD_SET_BUS_WIDTH, 2, SD_RESP_R1);
        if (ret != 0) {
            return ret;
        }
        SDMMC->CONTROL |= SDMMC_LW_MASK_0;
    }

    /* Standard-capacity cards address by byte and can be told to use a block
     * length other than 512; high-capacity cards are fixed at 512 and ignore
     * this. Sending it either way keeps the two paths identical below. */
    ret = sd_cmd_r1(SD_CMD_SET_BLOCKLEN, SD_BLOCK_SIZE, SD_RESP_R1);
    if (ret != 0) {
        return ret;
    }

    /* Default speed stops at 25 MHz. Going faster is only legal once the card
     * has been switched into high-speed mode with CMD6, and a card that will
     * not switch has to be held at 25 MHz rather than clocked past its rating
     * and hoped for.
     *
     * The switch is skipped entirely below 25 MHz, where it buys nothing. */
    self->high_speed = false;
    if (self->freq > 25000000) {
        if (sd_try_high_speed()) {
            self->high_speed = true;
        } else {
            self->freq = 25000000;
        }
    }

    self->freq = sd_set_clock(self->freq);
    return 0;
}

/* --- data transfer --- */

/* Wait for the card to leave the programming state after a write. The
 * controller's own R1b handling covers the busy signalling on DAT0, but a
 * multi-block write ends with CMD12 and the card can still be programming when
 * the next command arrives. */
static int sd_wait_ready(ch32h4_sd_t *self) {
    uint32_t deadline = millis() + 1000;
    for (;;) {
        int ret = sd_cmd(SD_CMD_SEND_STATUS, (uint32_t)self->rca << 16,
                         SD_RESP_R1);
        if (ret != 0) {
            return ret;
        }
        uint32_t status = sd_resp_short();
        if (status & SD_R1_ERROR_MASK) {
            return CH32H4_SD_EIO;
        }
        if (status & (1u << 8)) {   /* READY_FOR_DATA */
            return 0;
        }
        if ((int32_t)(millis() - deadline) > 0) {
            return CH32H4_SD_ETIMEDOUT;
        }
    }
}

/* Wait for one data phase to reach a flag worth acting on. Returns the flag
 * word, or 0 if the deadline passed first. */
static uint16_t sd_wait_data_flag(void) {
    uint32_t deadline = millis() + 2000;
    for (;;) {
        uint16_t fg = SDMMC->INT_FG & (SDMMC_IF_TRANDONE | SDMMC_IF_BKGAP
                                       | SDMMC_IF_TRANERR | SDMMC_IF_DATTMO
                                       | SDMMC_IF_FIFO_OV);
        if (fg != 0) {
            return fg;
        }
        if ((int32_t)(millis() - deadline) > 0) {
            return 0;
        }
    }
}

static int sd_data_flag_error(uint16_t fg) {
    if (fg == 0) {
        return CH32H4_SD_ETIMEDOUT;
    }
    if (fg & SDMMC_IF_DATTMO) {
        return CH32H4_SD_ETIMEDOUT;
    }
    if (fg & (SDMMC_IF_TRANERR | SDMMC_IF_FIFO_OV)) {
        return CH32H4_SD_EIO;
    }
    return 0;
}

/* Blocks the controller has transferred so far in this run. */
static uint32_t sd_blocks_done(void) {
    return SDMMC->STATUS & SDMMC_MASK_BLOCK_NUM;
}

/* Arm the data engine: reset it, set the direction, then the geometry, then
 * the address -- and the address write is also the trigger.
 *
 * The zero write to BLOCK_CFG is not idempotent configuration, it is the reset
 * of the block counter, and skipping it leaves a transfer inheriting the
 * previous one's state. */
static void sd_arm(const uint8_t *buf, uint32_t blocksize, uint32_t nblocks,
                   bool write) {
    /* Order the memcpy that filled the buffer against the register writes that
     * hand it to another bus master. This was not what fixed the write path --
     * adding it changed nothing -- but handing a buffer to a DMA engine
     * without a barrier is not something to leave to luck. */
    __asm volatile("fence" ::: "memory");
    SDMMC->BLOCK_CFG = 0;
    SDMMC->TRAN_MODE = write ? SDMMC_DMA_DIR : 0;
    SDMMC->BLOCK_CFG = (blocksize << 16) | nblocks;
    SDMMC->DMA_BEG1 = (uint32_t)buf;
}

/* A read is armed before its command, because the card starts sending as soon
 * as it has answered. Then it runs to completion on its own. */
static int sd_read_data(uint32_t nblocks) {
    for (;;) {
        uint16_t fg = sd_wait_data_flag();
        int err = sd_data_flag_error(fg);
        if (err != 0) {
            return err;
        }
        if (fg & SDMMC_IF_TRANDONE) {
            return 0;
        }
        /* BKGAP after each block. On a single-block read the two can arrive
         * together or BKGAP can arrive alone, so it counts as done there. */
        if (nblocks == 1 && (fg & SDMMC_IF_BKGAP)) {
            return 0;
        }
        SDMMC->INT_FG = SDMMC_IF_BKGAP;
    }
}

/* A write is armed *after* its command, and every block after the first has to
 * be kicked off by hand.
 *
 * Both halves are load-bearing and neither is symmetric with the read path.
 * Arming a write before its command -- which is what a read needs, and what
 * symmetry suggests -- makes the command itself time out. And writing DMA_BEG1
 * once for the whole run sends the first block and stops: the reference manual
 * says a multi-block write continues only when WRITE_CONT or DMA_BEG1 is
 * written again. */
static int sd_write_data(uint32_t nblocks) {
    /* The block counter still reads the previous transfer's total until the
     * engine picks up the new arming, so wait for it to fall back to zero
     * before believing it. Without this the loop below sees a count that
     * already satisfies it, returns while the block is still on the wire, and
     * the next command lands in the middle of a transfer and times out -- with
     * the write itself having reported success. The vendor driver opens its
     * own loop with the same wait. */
    uint32_t deadline = millis() + 200;
    while (sd_blocks_done() != 0) {
        if ((int32_t)(millis() - deadline) > 0) {
            return CH32H4_SD_ETIMEDOUT;
        }
    }

    while (sd_blocks_done() < nblocks) {
        uint16_t fg = sd_wait_data_flag();
        int err = sd_data_flag_error(fg);
        if (err != 0) {
            return err;
        }
        SDMMC->INT_FG = fg;
        if (sd_blocks_done() >= nblocks) {
            break;
        }
        SDMMC->WRITE_CONT = 0;
    }
    SDMMC->BLOCK_CFG = 0;
    return 0;
}

