Community-PIO-CH32V/ArduinoCore-CH32H4/cores/ch32h4/ch32h4_sdmmc.c
/* CMD6, SWITCH_FUNC. The card answers with a 64-byte status block on the data
 * lines rather than in a response register, so this is a data transfer with an
 * unusual block size -- hence sd_arm() taking one.
 *
 * The 512 bits are numbered from 511 at the first bit on the wire, so bit n
 * lives in byte (511 - n) / 8 at bit position n % 8. The two fields that
 * matter here work out as:
 *
 *   bits 415:400  functions group 1 supports -> bytes 12:13, so high speed
 *                 (function 1) is status[13] bit 1
 *   bits 379:376  function group 1 actually selected -> status[16] low nibble,
 *                 which reads back 0xF when the card declined
 */
static int sd_switch_func(uint32_t arg, uint8_t *status) {
    int ret = sd_wait_dat0();
    if (ret != 0) {
        return ret;
    }
    SDMMC->INT_FG = 0xFFFF;

    uint8_t *dma = sd_dma_buf[sd_dma_half];
    sd_dma_half ^= 1;
    sd_arm(dma, SD_SWITCH_STATUS_SIZE, 1, false);
    ret = sd_cmd_r1(SD_CMD_SWITCH_FUNC, arg, SD_RESP_R1);
    if (ret != 0) {
        return ret;
    }
    ret = sd_read_data(1);
    if (ret != 0) {
        return ret;
    }
    memcpy(status, dma, SD_SWITCH_STATUS_SIZE);
    return 0;
}

/* Ask group 1 for function 1, high speed. Mode 0 in bit 31 queries without
 * changing anything and mode 1 commits; the 0xF nibbles leave the other five
 * function groups alone. Returns false for every kind of "no", including a
 * card too old to know CMD6 at all, and the caller then stays at 25 MHz. */
static bool sd_try_high_speed(void) {
    uint8_t status[SD_SWITCH_STATUS_SIZE];

    if (sd_switch_func(0x00FFFFF1, status) != 0) {
        return false;
    }
    if (!(status[13] & 0x02)) {
        return false;
    }
    if (sd_switch_func(0x80FFFFF1, status) != 0) {
        return false;
    }
    if ((status[16] & 0x0F) != 1) {
        return false;
    }
    /* The card needs eight clocks at the old rate to finish adopting the new
     * timing before the clock changes under it. */
    sd_cmd_gap();
    return true;
}

/* One contiguous run of blocks, straight into or out of `buf`, which has
 * already been checked to be somewhere the DMA can reach. */
static int sd_transfer_dma(ch32h4_sd_t *self, uint32_t block, uint8_t *buf,
                           uint32_t nblocks, bool write) {
    uint32_t addr = self->card_type == CH32H4_SD_CARD_SDHC
                        ? block : block * SD_BLOCK_SIZE;
    int ret;

    /* The card holds DAT0 low while it is still programming a previous write;
     * starting a transfer into that produces a data timeout. */
    ret = sd_wait_dat0();
    if (ret != 0) {
        return ret;
    }
    SDMMC->INT_FG = 0xFFFF;

    if (write) {
        ret = sd_cmd_r1(nblocks == 1 ? SD_CMD_WRITE_BLOCK
                                     : SD_CMD_WRITE_MULTIPLE_BLOCK,
                        addr, SD_RESP_R1);
        if (ret != 0) {
            return ret;
        }
        sd_arm(buf, SD_BLOCK_SIZE, nblocks, true);
        ret = sd_write_data(nblocks);
    } else {
        sd_arm(buf, SD_BLOCK_SIZE, nblocks, false);
        ret = sd_cmd_r1(nblocks == 1 ? SD_CMD_READ_SINGLE_BLOCK
                                     : SD_CMD_READ_MULTIPLE_BLOCK,
                        addr, SD_RESP_R1);
        if (ret != 0) {
            return ret;
        }
        ret = sd_read_data(nblocks);
    }

    if (nblocks > 1) {
        /* CMD12 ends an open-ended multi-block transfer. It is owed even when
         * the transfer failed -- more so, in fact, since the card is then
         * still streaming. */
        int stop = sd_cmd_r1(SD_CMD_STOP_TRANSMISSION, 0, SD_RESP_R1B);
        if (ret == 0) {
            ret = stop;
        }
    }
    if (ret == 0 && write) {
        ret = sd_wait_ready(self);
    }
    return ret;
}

static int sd_transfer(ch32h4_sd_t *self, uint32_t block, uint8_t *buf,
                       uint32_t nblocks, bool write) {
    if (!self->initialised) {
        return CH32H4_SD_ENODEV;
    }
    if (block + nblocks > self->block_count) {
        return CH32H4_SD_ERANGE;
    }
    if (nblocks == 0) {
        return 0;
    }

    /* Always through a bounce buffer, and alternating between two of them.
     *
     * Both halves of that are deliberate. Every buffer a sketch is likely to
     * hand over is in DTCM, which this DMA cannot reach at all, so the copy is
     * unavoidable in practice and a direct path would be dead code that is
     * never exercised. And the alternation is what makes the engine reload its
     * address: writing DMA_BEG1 with the value it already holds starts a
     * transfer without moving the pointer back to the start of the buffer, so
     * a second transfer from the same address sends whatever followed the
     * first one. Two buffers used in turn mean the register always changes. */
    for (uint32_t done = 0; done < nblocks;) {
        uint32_t n = nblocks - done;
        if (n > SD_BOUNCE_BLOCKS) {
            n = SD_BOUNCE_BLOCKS;
        }
        uint8_t *chunk = buf + done * SD_BLOCK_SIZE;
        uint8_t *dma = sd_dma_buf[sd_dma_half];
        sd_dma_half ^= 1;
        if (write) {
            memcpy(dma, chunk, n * SD_BLOCK_SIZE);
        }
        int ret = sd_transfer_dma(self, block + done, dma, n, write);
        if (ret != 0) {
            return ret;
        }
        if (!write) {
            memcpy(chunk, dma, n * SD_BLOCK_SIZE);
        }
        done += n;
    }
    return 0;
}

/* --- public --- */

void ch32h4_sd_end(void) {
    ch32h4_sd_t *self = &ch32h4_sd;
    if (!self->initialised) {
        return;
    }

    /* Let the card finish programming before the clock goes away.
     *
     * A card holds DAT0 low while it writes, and the SD specification requires
     * the clock to keep running until it lets go. Cutting SDCLK in the middle
     * of that wedges the card: it stops responding to CMD0 as well, so the
     * NEXT begin() times out in ACMD41 and every one after that does too,
     * until the board is power-cycled. Reproduced by looping bulk-write then
     * re-init -- it survived two rounds and failed on the third.
     *
     * Bounded, because a card that never releases DAT0 must not hang a sketch
     * in a teardown path. Tearing down anyway is then the best available
     * option; it is already broken by that point. */
    (void)sd_wait_dat0();

