Community-PIO-CH32V/ArduinoCore-CH32H4/cores/ch32h4/ch32h4_sdmmc.c
    self->initialised = false;
    SDMMC->CLK_DIV = 0;

    /* Read back after each of these, for the reason spelled out in
     * sd_controller_reset(): they are read-modify-writes with no read-back of
     * their own, and a dropped one here leaves the block held in reset with
     * nothing to say so. */
    RCC_HBPeriphResetCmd(RCC_HBPeriph_SDMMC, ENABLE);
    (void)RCC->HBRSTR;
    RCC_HBPeriphResetCmd(RCC_HBPeriph_SDMMC, DISABLE);
    (void)RCC->HBRSTR;
    RCC_HBPeriphClockCmd(RCC_HBPeriph_SDMMC, DISABLE);
    (void)RCC->HBPCENR;

    sd_pin_release(SD_PORT_CK, SD_PIN_CK);
    sd_pin_release(SD_PORT_CMD, SD_PIN_CMD);
    sd_pin_release(SD_PORT_D0, SD_PIN_D0);
    if (self->width == 4) {
        sd_pin_release(SD_PORT_D1, SD_PIN_D1);
        sd_pin_release(SD_PORT_D2, SD_PIN_D2);
        sd_pin_release(SD_PORT_D3, SD_PIN_D3);
    }
}

uint32_t ch32h4_sd_debug(uint8_t which) {
    switch (which) {
        case 0: return SDMMC->CONTROL;
        case 1: return SDMMC->CLK_DIV;
        case 2: return SDMMC->STATUS;
        case 3: return SDMMC->INT_FG;
        case 4: return RCC->HBRSTR;
        case 5: return RCC->HBPCENR;
        default: return 0;
    }
}

int ch32h4_sd_begin(uint8_t width, uint32_t freq) {
    ch32h4_sd_t *self = &ch32h4_sd;

    if (width != 1 && width != 4) {
        return CH32H4_SD_EPARAM;
    }
    if (freq < 100000) {
        return CH32H4_SD_EPARAM;
    }
    if (freq > 50000000) {
        /* 50 MHz is where SD high speed stops. Past it needs UHS-I, which
         * needs 1.8 V signalling, which needs CMD11 and a voltage switch. */
        return CH32H4_SD_EPARAM;
    }

    /* Every SDMMC pin is on VIO18. Below 2.5 V a 3.3 V card reads the clock
     * and command lines as permanently low and nothing responds -- a failure
     * that looks like bad wiring and is not. PWR_CTLR bits [12:10] select the
     * rail: 0 = 1.2 V, 1 = 1.8 V, 2 = 2.5 V, 3 = 3.3 V. */
    RCC_HB1PeriphClockCmd(RCC_HB1Periph_PWR, ENABLE);
    (void)RCC->HB1PCENR;
    if (((PWR->CTLR >> 10) & 0x7u) < 2u) {
        return CH32H4_SD_EVOLTAGE;
    }

    ch32h4_sd_end();

    self->width = width;
    self->freq = freq;
    self->block_count = 0;

    RCC_HB2PeriphClockCmd(RCC_HB2Periph_GPIOC | RCC_HB2Periph_GPIOD
                          | RCC_HB2Periph_AFIO, ENABLE);
    (void)RCC->HB2PCENR;

    sd_pin_af(SD_PORT_CK, SD_PIN_CK);
    sd_pin_af(SD_PORT_CMD, SD_PIN_CMD);
    sd_pin_af(SD_PORT_D0, SD_PIN_D0);
    if (width == 4) {
        sd_pin_af(SD_PORT_D1, SD_PIN_D1);
        sd_pin_af(SD_PORT_D2, SD_PIN_D2);
        sd_pin_af(SD_PORT_D3, SD_PIN_D3);
    }
    sd_controller_reset(width);

    int ret = sd_card_identify(self);
    if (ret != 0) {
        /* One retry, from a full controller reset. A card that was left
         * mid-command by an earlier session can ignore the first CMD0 and
         * answer the second -- one round trip is cheap next to reporting a
         * card that is actually present as missing. */
        sd_controller_reset(width);
        ret = sd_card_identify(self);
    }
    if (ret != 0) {
        /* initialised is still false, so ch32h4_sd_end() would return without
         * doing anything. Set it so the teardown actually runs and the pins
         * and clock are released. */
        self->initialised = true;
        ch32h4_sd_end();
        return ret;
    }
    self->initialised = true;
    return 0;
}

int ch32h4_sd_read_blocks(uint32_t block, uint8_t *buf, uint32_t nblocks) {
    return sd_transfer(&ch32h4_sd, block, buf, nblocks, false);
}

int ch32h4_sd_write_blocks(uint32_t block, const uint8_t *buf,
                           uint32_t nblocks) {
    return sd_transfer(&ch32h4_sd, block, (uint8_t *)buf, nblocks, true);
}
